Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: bending at least four locking tabs (74) positioned about the opening (73) in the locking tab washer (70) towards a head of the bolt (40) to rotatably lock the bolt (40), the at least four locking tabs (74) having a predetermined angular distribution about the opening (73), the predetermined angular distribution selected so that the at least four locking tabs (74) are circumferentially spaced apart from one another at integer multiples of a common angle relative to the center of the opening (73) so that at least one of the at least four locking tabs (74) has at least half of its width aligned with a loaded half surface (42b) of a corresponding flat surface (42) of the bolt (40) regardless of a relative angular position between the head of the bolt (40) and the locking tab washer (70); and
de_de: Biegen von mindestens vier Sicherungslaschen (74), die um die Öffnung (73) in der Sicherungslaschenscheibe (70) herum angeordnet sind, in Richtung eines Kopfes der Schraube (40), um die Schraube (40) drehbar zu sichern, wobei die mindestens vier Sicherungslaschen (74) eine vorbestimmte Winkelverteilung um die Öffnung (73) aufweisen, wobei die vorbestimmte Winkelverteilung derart gewählt ist, dass die mindestens vier Sicherungslaschen (74) in Umfangsrichtung um ganzzahlige Vielfache eines gemeinsamen Winkels relativ zu dem Mittelpunkt der Öffnung (73) voneinander beabstandet sind, sodass mindestens eine der mindestens vier Sicherungslaschen (74) mit mindestens der Hälfte ihrer Breite an einer belasteten Halbfläche (42b) einer entsprechenden flachen Fläche (42) der Schraube (40) ausgerichtet ist, unabhängig von einer relativen Winkelposition zwischen dem Kopf der Schraube (40) und der Sicherungslaschenscheibe (70); und

source: engaging a retaining feature positioned about the opening (73) in the locking tab washer (70) with an engagement surface on at least one of the two components (50, 60), wherein the retaining feature includes a pair of anti-rotation tabs (75) and wherein the anti-rotation tabs (75) are operable to abut against scalloped edges (54, 62) of a radially outer surface (53) of a flange (52) of the component (50, 60).
de_de: Eingreifen eines um die Öffnung (73) in der Sicherungslaschenscheibe (70) herum angeordneten Haltemerkmals in eine Eingriffsfläche an mindestens einer der beiden Komponenten (50, 60), wobei das Haltemerkmal ein Paar Verdrehsicherungslaschen (75) beinhaltete und wobei die Verdrehsicherungslaschen (75) dazu dienen, an gezackten Kanten (54, 62) einer radial äußeren Fläche (53) eines Flansches (52) der Komponente (50, 60) anzuliegen.

source: The method as defined in claim 10, wherein engaging the retaining feature includes positioning a first anti-rotation tab (75) extending radially from the opening (73) against the engagement surface in a direction opposite a direction of a tightening of the bolt (40).
de_de: Verfahren nach Anspruch 10, wobei das Eingreifen des Haltemerkmals das Positionieren einer ersten Verdrehsicherungslasche (75) umfasst, die sich radial von der Öffnung (73) gegen die Eingriffsfläche in einer Richtung erstreckt, die der Richtung des Festziehens der Schraube (40) entgegengesetzt ist.

source: The method as defined in claim 10, wherein engaging the retaining feature further includes abutting a foot extending radially outwardly from the opening (73) against the engagement surface.
de_de: Verfahren nach Anspruch 10, wobei das Eingreifen des Haltemerkmals ferner das Anliegen eines Fußes, der sich radial von der Öffnung (73) nach außen erstreckt, an der Eingriffsfläche beinhaltet.

source: The method as defined in claim 10, further comprising:
de_de: Verfahren nach Anspruch 10, ferner umfassend:

source: inserting a second bolt (40) through a second opening (73) in the locking tab washer (70) and through additional apertures in the two components (50, 60) aligned with the second opening (73), the second opening (73) operatively coupled to the opening (73) via a linking member (77);
de_de: Einführen einer zweiten Schraube (40) durch eine zweite Öffnung (73) in der Sicherungslaschenscheibe (70) und durch zusätzliche Aussparungen in den beiden Komponenten (50, 60), die an der zweiten Öffnung (73) ausgerichtet sind, wobei die zweite Öffnung (73) über ein Verbindungselement (77) funktionsfähig mit der Öffnung (73) verbunden ist;

source: torqueing the second bolt (40) to a second predetermined degree; and
de_de: Festziehen der zweiten Schraube (40) auf einen zweiten vorbestimmten Grad; und

source: bending at least four additional locking tabs (74) positioned about the second opening (73) towards a head of the second bolt (40) to rotatably lock the bolt (40), at least one of the at least four additional locking tabs (74) having at least half of its width aligned with a loaded half surface (42b) of a corresponding flat surface (42) of the second bolt (40) to prevent untorqueing of the second bolt (40).
de_de: Biegen von mindestens vier zusätzlichen Sicherungslaschen (74), die um die zweite Öffnung (73) herum positioniert sind, in Richtung eines Kopfes der zweiten Schraube (40), um die Schraube (40) drehbar zu sichern, wobei mindestens eine der mindestens vier zusätzlichen Sicherungslaschen ( 74 ) mit mindestens der Hälfte ihrer Breite an einer belasteten Halbfläche (42b) einer entsprechenden ebenen Fläche (42) der zweiten Schraube (40) ausgerichtet ist, um ein Lösen der zweiten Schraube (40) zu verhindern.

source: 1. A method of controlling the geometrical configuration of a variable geometry element (46) of a compressor stage (24) of a gas turbine engine (10; 100), the method comprising:
de_de: 1. Verfahren zur Steuerung der geometrischen Konfiguration eines Elements mit variabler Geometrie (46) einer Verdichterstufe (24) eines Gasturbinenmotors (10; 100), wobei das Verfahren umfasst:

source: determining a mass flow rate W of working fluid circulating through the compressor stage (24), including:
de_de: Bestimmen eines Massenstroms W des durch die Verdichterstufe (24) zirkulierenden Arbeitsfluids, einschließlich:

source: determining whether a difference (408) between an expected value of normalized mass flow rate QHPT through a high-pressure turbine of the gas turbine engine (10; 100) and an actual value of normalized mass flow rate Qcurr through the high-pressure turbine exceeds a threshold value, wherein the actual value of normalized mass flow rate Qcurr is a function of a current value of mass flow rate Wcurr, a current value of pressure Pcurr, and a current value of temperature Tcurr through the high-pressure turbine based on the relationship
de_de: Bestimmen, ob eine Differenz (408) zwischen einem erwarteten Wert des normalisierten Massenstroms QHPT durch eine Hochdruckturbine des Gasturbinenmotors (10; 100) und einem tatsächlichen Wert des normalisierten Massenstroms Qcurr durch die Hochdruckturbine einen Schwellenwert überschreitet, wobei der tatsächliche Wert des normalisierten Massenstroms Qcurr eine Funktion eines aktuellen Werts des Massenstroms Wcurr, eines aktuellen Werts des Drucks Pcurr und eines aktuellen Werts der Temperatur Tcurr durch die Hochdruckturbine ist, basierend auf der Beziehung

source: if the difference (408) exceeds the threshold value, updating (410) the value of Wcurr, and returning to the step of determining whether the difference (408) exceeds the threshold value on the basis of the updated value of Wcurr; and
de_de: wenn die Differenz (408) den Schwellenwert überschreitet, Aktualisieren (410) des Werts von Wcurr und Zurückkehren zu dem Schritt des Bestimmens, ob die Differenz (408) den Schwellenwert überschreitet, basierend auf dem aktualisierten Wert von Wcurr; und

source: if the difference (408) does not exceed the threshold value, outputting (412) the value of Wcurr as a determined value of mass flow rate W;
de_de: wenn die Differenz (408) den Schwellenwert nicht überschreitet, Ausgeben (412) des Werts von Wcurr als ein bestimmter Wert des Massenstroms W;

source: determining a value of the mass flow rate W through the compressor stage (24) based on the determined value of mass flow rate W through the high-pressure turbine;
de_de: Bestimmen eines Werts des Massenstroms W durch die Verdichterstufe (24) basierend auf dem bestimmten Wert des Massenstroms W durch die Hochdruckturbine;

source: determining a control parameter value (52) associated to the geometrical configuration of the variable geometry element based on the determined value of mass flow rate W through the compressor stage (24); and
de_de: Bestimmen eines Werts eines Steuerparameters (52), der mit der geometrischen Konfiguration des Elements mit variabler Geometrie verknüpft ist, basierend auf dem bestimmten Wert des Massenstroms W durch die Verdichterstufe (24); und

source: changing the geometrical configuration of the variable geometry element (46) in accordance with the determined control parameter (52) value.
de_de: Ändern der geometrischen Konfiguration des Elements mit variabler Geometrie (46) gemäß dem bestimmten Wert des Steuerparameters (52).

source: 2. The method of claim 1 wherein said determining (406) whether the difference (408) exceeds the threshold value includes determining the ratio between QHPT and Qcurr, wherein said updating (410) the value of Wcurr is based on the ratio between QHPT and Qcurr.
de_de: 2. Verfahren nach Anspruch 1, wobei das Bestimmen (406), ob die Differenz (408) den Schwellenwert überschreitet, das Bestimmen des Verhältnisses zwischen QHPT und Qcurr beinhaltet, wobei das Aktualisieren (410) des Werts von Wcurr auf dem Verhältnis zwischen QHPT und Qcurr basiert.

source: 3. The method of any preceding claim performed while the gas turbine engine (10; 100) is in operation on an aircraft.
de_de: 3. Verfahren nach einem der vorhergehenden Ansprüche, das durchgeführt wird, während das Gasturbinenmotor (10; 100) in einem Flugzeug in Betrieb ist.

source: 4. The method of any preceding claim wherein the variable geometry element (46) is a set of variable guide vanes (30, 32), and the change in the geometrical configuration corresponds to a change in the angle of attack of the variable guide vanes (30, 32).
de_de: 4. Verfahren nach einem der vorhergehenden Ansprüche, wobei das Element mit variabler Geometrie (46) ein Satz variabler Leitschaufeln (30, 32) ist und die Änderung der geometrischen Konfiguration einer Änderung des Anstellwinkels der variablen Leitschaufeln (30, 32) entspricht.

source: 5. The method of any of claims 1 to 3 wherein the variable geometry element (46) is a bleed valve (34) and the change in the geometrical configuration corresponds to a change in the % of opening of the bleed valve (34).
de_de: 5. Verfahren nach einem der Ansprüche 1 bis 3, wobei das Element (46) mit variabler Geometrie ein Entlüftungsventil (34) ist und die Änderung der geometrischen Konfiguration einer Änderung des Öffnungsgrads des Entlüftungsventils (34) entspricht.

source: 6. The method of any preceding claim wherein the control parameter value (52) is a first control parameter value associated to the geometrical configuration of a first variable geometry element (46), further comprising determining a second control parameter value (52) associated to the geometrical configuration of a second variable geometry element (46) based on the determined value of mass flow rate W, further comprising changing the geometrical configuration of the second variable geometry element (46) based on the second determined control parameter value (52).
de_de: 6. Verfahren nach einem der vorhergehenden Ansprüche, wobei der Wert des Steuerparameters (52) ein erster Wert des Steuerparameters ist, der mit der geometrischen Konfiguration eines ersten Elements mit variabler Geometrie (46) verknüpft ist, wobei das Verfahren ferner das Bestimmen eines zweiten Werts des Steuerparameters (52) umfasst, der mit der geometrischen Konfiguration eines zweiten Elements mit variabler Geometrie (46) verknüpft ist, basierend auf dem bestimmten Wert des Massenstroms W, wobei das Verfahren ferner das Ändern der geometrischen Konfiguration des zweiten Elements mit variabler Geometrie (46) basierend auf dem zweiten bestimmten Wert des Steuerparameters (52) umfasst.

source: 7. The method of any preceding claim, wherein the expected value is an expected value of the normalised mass flow rate determined for a choked condition, and the method further comprises determining (416) whether the high-pressure turbine of the gas turbine engine (10; 100) is operating in the choked condition, and said determining the control parameter value (52) based on the determined value of mass flow rate W is contingent upon a determination (416) that the high-pressure turbine of the gas turbine engine (10; 100) is operating in the choked condition.
de_de: 7. Verfahren nach einem der vorhergehenden Ansprüche, wobei der erwartete Wert ein erwarteter Wert des normalisierten Massenstroms ist, der für einen gedrosselten Zustand bestimmt wurde, und das Verfahren ferner das Bestimmen (416) umfasst, ob die Hochdruckturbine des Gasturbinenmotors (10; 100) in dem gedrosselten Zustand arbeitet, und das Bestimmen des Werts des Steuerparameters (52) basierend auf dem bestimmten Wert des Massenstroms W von einer Bestimmung (416) abhängt, dass die Hochdruckturbine des Gasturbinenmotors (10; 100) in dem gedrosselten Zustand arbeitet.

source: 8. The method of any preceding claim wherein said determining the control parameter value (52) includes establishing (420) a match between the determined value of mass flow rate W and the control parameter value (52), wherein optionally:
de_de: 8. Verfahren nach einem der vorhergehenden Ansprüche, wobei das Bestimmen des Werts des Steuerparameters (52) das Feststellen (420) einer Übereinstimmung zwischen dem bestimmten Wert des Massenstroms W und dem Wert des Steuerparameters (52) beinhaltet, wobei optional:

source: said establishing (420) a match includes establishing a match between values of a plurality of monitored parameters (54) including the determined value of mass flow rate W and the control parameter value (52); and/or
de_de: das Feststellen (420) einer Übereinstimmung das Feststellen einer Übereinstimmung zwischen Werten einer Vielzahl von überwachten Parametern (54), einschließlich des bestimmten Werts des Massenstroms W und des Werts des Steuerparameters (52), beinhaltet; und/oder

source: said changing the geometrical configuration of the variable geometry element (46) includes setting a geometrical configuration of the variable geometry element (46) in a manner to correspond to the control parameter value (52).
de_de: wobei das Ändern der geometrischen Konfiguration des Elements mit variabler Geometrie (46) das Einstellen einer geometrischen Konfiguration des Elements mit variabler Geometrie (46) in einer Weise beinhaltet, die dem Wert des Steuerparameters (52) entspricht.

source: 9. The method of any preceding claim further comprising:
de_de: 9. Verfahren nach einem der vorhergehenden Ansprüche, ferner umfassend:

source: determining an operating point (82) of the gas turbine engine based on current values (56) of a or the plurality of monitored parameters (54), determining (422) a difference between the operating point (82) of the gas turbine engine (10; 100) and a operating line point (84), wherein the control parameter value (52) corresponds to a requested value of change (424) in the geometrical configuration of the variable geometry element (46), said requested value of change (424) being associated with the difference (86) between the current operating point (82) and the operating line point (84), wherein said changing the geometrical configuration of the variable geometry element (46) is performed in accordance with the requested value of change (424); wherein optionally
de_de: Bestimmen eines Betriebspunkts (82) der Gasturbine basierend auf aktuellen Werten (56) von einem oder der Vielzahl von überwachten Parametern (54), Bestimmen (422) einer Differenz zwischen dem Betriebspunkt (82) der Gasturbine (10; 100) und einem Betriebslinienpunkt (84), wobei der Wert des Steuerparameters (52) einem angeforderten Änderungswert (424) in der geometrischen Konfiguration des Elements mit variabler Geometrie (46) entspricht, wobei der angeforderte Änderungswert (424) mit der Differenz (86) zwischen dem aktuellen Betriebspunkt (82) und dem Betriebslinienpunkt (84) verknüpft ist, wobei das Ändern der geometrischen Konfiguration des Elements mit variabler Geometrie (46) gemäß dem angeforderten Änderungswert (424) durchgeführt wird; wobei optional

source: the plurality of monitored parameters (54) include the determined value of mass flow rate W; and/or
de_de: die Vielzahl von überwachten Parametern (54) den bestimmten Wert des Massenstroms W beinhaltet; und/oder

source: prior to said changing the geometrical configuration, comparing (428) the requested value of change to a change threshold value, and setting (414) the requested value of change to the change threshold value contingent upon said compared requested value of change exceeding the change threshold value; and/or
de_de: vor dem Ändern der geometrischen Konfiguration Vergleichen (428) des angeforderten Änderungswerts mit einem Änderungsschwellenwert und Einstellen (414) des angeforderten Änderungswerts auf den Änderungsschwellenwert, sofern der verglichene angeforderte Änderungswert den Änderungsschwellenwert überschreitet; und/oder

source: repeating the steps of determining the mass flow rate, determining the current operating point (82), determining the control parameter (52) value, and said changing the geometrical configuration wherein said changing the geometrical configuration is contingent upon said difference (86) between the current operating point (82) and the operating line point (84) exceeding an operating line threshold value.
de_de: Wiederholen der Schritte des Bestimmens des Massenstroms, des Bestimmens des aktuellen Betriebspunkts (82), des Bestimmens des Werts des Steuerparameters (52) und des Änderns der geometrischen Konfiguration, wobei das Ändern der geometrischen Konfiguration davon abhängt, dass die Differenz (86) zwischen dem aktuellen Betriebspunkt (82) und dem Betriebslinienpunkt (84) einen Betriebslinienschwellenwert überschreitet.

source: The method of any preceding claim performed on both a or the first variable geometry element (46) of a first compressor stage (26) of the gas turbine engine (10; 100), and on a or the second variable geometry element (46) of a second compressor stage (28) of the gas turbine engine (10; 100), during real-time operation of the gas turbine engine (10; 100).
de_de: Verfahren nach einem der vorhergehenden Ansprüche, das während des Echtzeitbetriebs des Gasturbinenmotors (10; 100) sowohl an einem oder dem ersten Element mit variabler Geometrie (46) einer ersten Verdichterstufe (26) des Gasturbinenmotors (10; 100) als auch an einem oder dem zweiten Element mit variabler Geometrie (46) einer zweiten Verdichterstufe (28) des Gasturbinenmotors (10; 100) durchgeführt wird.

source: The method of any preceding claim wherein said determining (406) whether the difference (408) exceeds the threshold value includes determining Pcurr based on a measured value of pressure taken upstream of the combustor and a known pressure loss, further comprising measuring values of temperature and pressure downstream of the combustor, engine output torque and determining Tcurr based on a known relationship between power, torque, mass flow rate, temperature difference and pressure difference, using the current value of mass flow rate Wcurr.
de_de: Verfahren nach einem der vorhergehenden Ansprüche, wobei das Bestimmen (406), ob die Differenz (408) den Schwellenwert überschreitet, das Bestimmen von Pcurr basierend auf einem gemessenen Druckwert vor der Brennkammer und einem bekannten Druckverlust beinhaltet, ferner umfassend das Messen von Temperatur- und Druckwerten hinter der Brennkammer, des Motorausgangsdrehmoments und das Bestimmen von Tcurr basierend auf einer bekannten Beziehung zwischen Leistung, Drehmoment, Massenstrom, Temperaturdifferenz und Druckdifferenz unter Verwendung des aktuellen Werts des Massenstroms Wcurr.

source: A computer program product stored in a non-transitory computer readable memory and comprising instructions operative to, when executed by a processor, perform a method of controlling the geometrical configuration of a variable geometry element (46) of a compressor stage (24) of a gas turbine engine (10; 100), the method comprising:
de_de: Computerprogrammprodukt, das in einem nichtflüchtigen, computerlesbaren Speicher gespeichert ist und Anweisungen umfasst, die dazu dienen, wenn sie durch einen Prozessor ausgeführt werden, ein Verfahren zur Steuerung der geometrischen Konfiguration eines Elements mit variabler Geometrie (46) einer Verdichterstufe (24) eines Gasturbinenmotors (10; 100) durchzuführen, wobei das Verfahren Folgendes umfasst:

source: determining a mass flow rate W of working fluid circulating through the compressor stage (24), including
de_de: Bestimmen eines Massenstroms W des durch die Verdichterstufe (24) zirkulierenden Arbeitsfluids, einschließlich

source: determining (406) whether a difference (408) between an expected value of normalized mass flow rate QHPT through a high-pressure turbine of the gas turbine engine (10; 100) and an actual value of normalized mass flow rate Qcurr through the high-pressure turbine exceeds a threshold value, wherein the actual value of normalized mass flow rate Qcurr is a function of a current value of mass flow rate Wcurr, a current value of pressure Pcurr, and a current value of temperature Tcurr through the high-pressure turbine based on the relationship
de_de: Bestimmen (406), ob eine Differenz (408) zwischen einem erwarteten Wert des normalisierten Massenstroms QHPT durch eine Hochdruckturbine des Gasturbinenmotors (10; 100) und einem tatsächlichen Wert des normalisierten Massenstroms Qcurr durch die Hochdruckturbine einen Schwellenwert überschreitet, wobei der tatsächliche Wert des normalisierten Massenstroms Qcurr eine Funktion eines aktuellen Werts des Massenstroms Wcurr, eines aktuellen Werts des Drucks Pcurr und eines aktuellen Werts der Temperatur Tcurr durch die Hochdruckturbine ist, basierend auf der Beziehung

source: if the difference (408) exceeds the threshold value, updating (410) the value of Wcurr, and returning to the step of determining (406) whether the difference (408) exceeds the threshold value on the basis of the updated value of Wcurr; and
de_de: wenn die Differenz (408) den Schwellenwert überschreitet, Aktualisieren (410) des Werts von Wcurr und Zurückkehren zu dem Schritt des Bestimmens (406), ob die Differenz (408) den Schwellenwert überschreitet, basierend auf dem aktualisierten Wert von Wcurr; und

source: determining a control parameter (52) value associated to the geometrical configuration of the variable geometry element based on the determined value of mass flow rate W through the compressor stage (24); and
de_de: Bestimmen eines Werts eines Steuerparameters (52), der mit der geometrischen Konfiguration des Elements mit variabler Geometrie verknüpft ist, basierend auf dem bestimmten Wert des Massenstroms W durch die Verdichterstufe (24); und
